package oop;

//ООП - парадигма программирования в котором программа строится на взаимодействии классов и объектов

/*  Класс — это определяемый пользователем план или прототип, на основе которого создаются объекты.
    Он представляет собой набор свойств или методов, общих для всех объектов одного типа. Используя классы,
    вы можете создавать несколько объектов с одинаковым поведением вместо того, чтобы писать их код несколько раз
 */

/*  Объект — это сущность, способная сохранять свое состояние (информацию) и обеспечивающая набор операций
    (поведение) для проверки и изменения этого состояния. Объект это экземпляр какого-либо класса
*/

/*  Если брать в теории, то скажем что человек является определенным классов(каким-то типом данных), а вот каждый человек является объектом,
    экземпляром класса. В мире более 7миллиардов человек, то есть получается что один класс человек, и 7 миллиардов объектов, экземпляров этого
    класса.
    У человека есть параметры, имя, рост, вес, национальность и т.д. В программировании они будут свойствами, то есть полями класса.
    Человек может кушать, спать, бегать и т.д., в программировании все это считается методами.
 */

/*  Конструктор — это метод класса, который инициализирует новый объект после его создания. Если мы хотим дать объекту какие-то начальные
    параметры, то мы можем все это прописать в конструкторе класса. Например, если брать наш пример человека, то мы знаем,
    что при рождении ребенка, у него есть изначальный вес, начальный возраст, рост и т.д. Позже, когда уже ребенок растет, у него
    меняется его вес, возраст и рост, то есть это мы можем уже изменить с помощью методов
*/




public class Main
{
    public static void main(String[] args) {
        Human human1 = new Human("Askar", 20);
        human1.greeting();
    }

}

class Human
{
    public String name;
    public String surname;
    public int age;

    public Human(){}; //Пустой конструктор
    public Human(String name, String surname, int age)//Конструктор с параметрами
    {
        this.name = name;
        this.surname = surname;
        this.age = age;
    }
    public Human(String name, int age)
    {
        this.name = name;
        this.age = age;
    }

    public void greeting()
    {
        System.out.println("My name is " + name +". I'm " + age + " years old");
    }
}

