package methods;

/*
    Метод - это блок кода, который при вызове выполняет определенные действия, указанные в нем

    Методы состоят из нескольких частей:
    1. идентификатор доступа -- public
    2. тип возвращаемого значения -- void, int, String, etc
    3. название метода
    4. список параметров
    5. тело метода, где находится логика метода

    Ключевое слово return завершает выполнение метода и может использоваться для возврата значения из метода
*/
public class Main
{
    public static void main(String[] args) {

    }
}
