package abstractClasses;

//Абстрактный класс: это ограниченный класс, который нельзя использовать для создания объектов
// (для доступа к нему он должен быть унаследован от другого класса).

//Абстрактный метод: может использоваться только в абстрактном классе и не имеет тела.
//Тело предоставляется подклассом (наследуется от).

//Отличие интерфейса от абстрактного класса
//Интерфейс определяет что умеет делать реализующий его класс
//Абстрактный класс определяет то чем является наследующий его класс
public class Main
{
    public static void main(String[] args)
    {

    }
}
