package enums;

//Enum в Java — это тип данных, который содержит фиксированный набор констант.
//Они представляют набор логически связанных констант.
//В переводе с английского - перечисление.

//Java Enum внутренне наследует класс Enum , поэтому он не может наследовать какой-либо другой класс,
//но может реализовывать множество интерфейсов.
//Создать экземпляр перечисления с помощью оператора new нельзя, но в остальном перечисление обладает всеми возможностями, которые имеются у других классов.
//А именно - в перечисления можно добавлять конструкторы, переменные и методы. Конструкторы перечисления являются private по умолчанию.
public class Main
{
    public static void main(String[] args) {
        //enumeration
    }
}
