package serialization;

//Сериализация — это процесс преобразования объекта в поток байтов для сохранения или передачи в память, базу данных или файл.
//Эта операция предназначена для того, чтобы сохранить состояния объекта для последующего воссоздания при необходимости.
//Десериализация - это обратный сериализации процесс.

//Запись массива, 1 способ, 2 способ

//Transient
//Отмеченные этим модификатором поля не записываются в поток байт при сериализации.
//При десериализации объекта такие поля инициализируются значением по умолчанию.

//SerialVersionUID
public class Main
{
    public static void main(String[] args)
    {

    }
}
