package polymorphism;

//Полиморфизм — это способность объекта принимать различные формы.

//Переопределение методов, добавление новых полей
//upcasting, down-casting

//Приведение типов — одна из наиболее важных концепций, которая в основном имеет дело с неявным или явным преобразованием одного типа данных
// в другой тип данных.

//Upcasting — это приведение дочернего объекта к родительскому объекту.(Восходящее преобразование)
//Down-casting - приведение типов родительского объекта к дочернему объекту.(Нисходящее преобзование)


//overriding, overloading
//Переопределние, перегрузка
//Перегрузка методов — это приём программирования, который позволяет разработчику в одном классе для методов с разными параметрами использовать
// одно и то же имя. В этом случае мы говорим, что метод перегружен.


//В Java есть специальный суперкласс Object и все классы являются его подклассами. Поэтому ссылочная переменная класса Object может ссылаться на
// объект любого другого класса. Так как массивы являются тоже классами, то переменная класса Object может ссылаться и на любой массив.
public class Main
{

}
