package interfaces;

//Интерфейс - это абстрактный тип данных, содержащий набор методов и констант.
//Это одна из основных концепций Java, которая используется для достижения абстракции, полиморфизма и множественного наследования.
//В общих чертах интерфейс можно определить как контейнер, в котором хранятся сигнатуры методов, которые должны быть реализованы
//в сегменте кода

//      -Интерфейс — это "контракт подписи методов", что означает, что он гарантирует реализацию данных методов.
//То есть, как минимум интерфейсы нужны для того, чтобы в других классах которые его реализовывают задать такое же поведение
//и ничего не забыть

//      -Интерфейс хранит только сигнатуру метода, а не определение метода. Сигнатуры методов позволяют интерфейсу достичь полной
//абстракции, скрывая реализацию метода от пользователя. Достижение абстракции

//      -Интерфейс позволяет достичь множественного наследования.

//Если статично поле - оно едино для всех объектов.
//Если статичен метод - он привязан к классу а не к объекту.
//Если статичен класс - он не имеет экземпляров.

//Ключевое слово static применимо к переменным, методам, блокам инициализации, импорту и вложенным классам (nested classes).

public class Main
{
    public static void main(String[] args)
    {

    }
}
