package strings.homeworkTasks;
//Напишите программу, которая считывает строку, и выводит true если в заданной строке встречается слово good.
public class Sixth
{
    public static void main(String[] args) {
        String str = "godibye";
        if(str.contains("good"))
        {
            System.out.println("true");
        }
    }
}
